samdonnelly/STM32F4-driver-test/src/tests/device_tests/fatfs_test.c
/**
 * @file fatfs_test.c
 * 
 * @author Sam Donnelly (samueldonnelly11@gmail.com)
 * 
 * @brief FATFS driver test 
 * 
 * @version 0.1
 * @date 2022-08-28
 * 
 * @copyright Copyright (c) 2022
 * 
 */

//=======================================================================================
// Includes 

#include "fatfs_test.h"
#include "stm32f4xx_it.h"

//=======================================================================================


//=======================================================================================
// Macros 

// Buffer sizes 
#define DATA_BUFF_SIZE 250
#define CMD_SIZE 100         // Max user command string length 

// User interface 
#define NUM_TEST_CMDS 21     // Number of driver test commands for the user 

//=======================================================================================


//=======================================================================================
// Enums 

// User input type 
typedef enum {
    FORMAT_FILE_STRING, 
    FORMAT_FILE_MODE, 
    FORMAT_FILE_NUM 
} format_user_input_t; 

//=======================================================================================


//=======================================================================================
// Prototypes 

// User command functions 
void file_mkfs(void);         // Format the volume 
void mount_card(void);        // Mount the volume 
void unmount_card(void);      // Unmount the volume 
void card_capacity(void);     // Card Capacity 
void file_check(void);        // Check existance of a file or sub-directory 
void file_remove(void);       // Remove files from the drive 
void file_mkdir(void);        // Make a new directory 
void file_chdir(void);        // Change the current directory 
void file_getcwd(void);       // Retrieve the current directory and drive 
void file_opendir(void);      // Open a directory 
void file_closedir(void);     // Close an open directory 
void file_find(void);         // Find files on card 
void file_open(void);         // Open a file 
void file_close(void);        // Close the open file 
void file_read(void);         // Read from an open file using using f_read 
void file_write(void);        // Write to an open file using f_write 
void file_seek(void);         // Navigate the file 
void file_rewind(void);       // Navigate to the beginning of the file 
void file_fast_fwd(void);     // Navigate to the end of the file 
void file_gets(void);         // Read from an open file using f_gets 
void file_puts(void);         // Write to an open file using f_puts 

// Command control 
void cmd_select(void);                                             // Select command based on user input 
void cmd_reset(void);                                              // Return to default state at the end of the command dispatch 
void string_display(const char *str_format, const char *str_arg);  // Display string with string argument 
void number_display(const char *str_format, const DWORD num_arg);  // Display string with number argument 
void fault_display(void);                                          // Display the error code related to the FATFS operation 
void feedback_display(const char *string);                         // Display a string for the user to see 

// // Get user inputs 
// void get_input(
//     char *str, 
//     char *buff, 
//     uint8_t buff_len, 
//     QWORD *data, 
//     format_user_input_t op);

// Format user input 
uint8_t format_input(
    char *buff, 
    DWORD *data, 
    format_user_input_t op);

//=======================================================================================


//=======================================================================================
// Global variables 

// Data record 
typedef struct fatfs_test_record_s 
{
    // Peripherals 
    SPI_TypeDef *spi;
    USART_TypeDef *uart;
    DMA_Stream_TypeDef *dma_stream;
    TIM_TypeDef *tim;

    // Serial interface data 
    uint8_t cb[DATA_BUFF_SIZE];              // Circular buffer populated by DMA 
    cb_index_t cb_index;                     // Circular buffer indexing info 
    dma_index_t dma_index;                   // DMA transfer indexing info 
    uint8_t data_in_buff[DATA_BUFF_SIZE];    // Buffer that stores latest UART input 
    uint8_t data_out_buff[DATA_BUFF_SIZE];   // Buffer that stores outgoing data 

    DWORD data_in_num;

    uint8_t state_seq;

    // State tracking 
    void (*state_func_ptr)(void);

    // // User data 
    // BYTE access_mode;                     // File access mode (byte) 
    // QWORD position;                       // File position (byte num) 
    // QWORD read_len;                       // Read data size (bytes) 
    // BYTE cmd_index;                       // For indixing function pointers 

    // // User and data buffers 
    // char cmd_buff[CMD_SIZE];              // Stores user commands 
    // char feedback_buff[BUFF_SIZE];        // Stores user feedback 
    // char buffer[BUFF_SIZE];               // To store the data that we can read or write
    // char path_buff[CMD_SIZE];             // Stores path to file or directory 
    // char file_mode_buff[CMD_SIZE];        // Stores file access modes input by the user 
    
    // File variables 
    FATFS   file_sys;                     // File system 
    FIL     file;                         // File 
    FRESULT fresult;                      // Store the result of each operation 
    UINT    br, bw;                       // Stores f_read and f_write byte counters 
    DIR     dj;                           // Directory object 
    FILINFO fno;                          // File information 

    // Card capacity 
    FATFS *pfs;                           // Pointer to file system object 
    DWORD fre_clust;                      // Stores number of free clusters 
    DWORD total, free_space;              // Total and free volume space 

// #if FORMAT_EXFAT 

    BYTE work[512];                       // Used to format the volume 

// #endif   // FORMAT_EXFAT
} 
fatfs_test_record_t;

// Data record instance 
static fatfs_test_record_t fatfs_data;


// Command pointers 
typedef struct fatfs_user_cmds_s 
{
    char user_cmds[CMD_SIZE];              // Stores the defined user input commands 
    void (*fatfs_func_ptrs_t)(void);       // Pointer to FatFs file operation function 
}
fatfs_user_cmds_t;

// User commands 
static const fatfs_user_cmds_t cmd_table[NUM_TEST_CMDS] = 
{
    // Volume Management and System Configuration commands 
    {"mount",     &mount_card},
    {"unmount",   &unmount_card},
    {"mkfs",      &file_mkfs},
    {"getfree",   &card_capacity},
    // File and Directory Management commands 
    {"stat",      &file_check},
    {"unlink",    &file_remove},
    {"mkdir",     &file_mkdir},
    {"chdir",     &file_chdir},
    {"getcwd",    &file_getcwd},
    // Directory Access commands 
    {"opendir",   &file_opendir},
    {"closedir",  &file_closedir},
    {"find",      &file_find},
    // File Access commands 
    {"openfile",  &file_open},
    {"closefile", &file_close},
    {"read",      &file_read},
    {"write",     &file_write},
    {"lseek",     &file_seek},
    {"rewind",    &file_rewind},
    {"fastfwd",   &file_fast_fwd},
    {"gets",      &file_gets},
    {"puts",      &file_puts}
};


// FatFs layer disk status - used for clearing the init status for re-mounting 
extern Disk_drvTypeDef disk;

//=======================================================================================


//=======================================================================================
// Setup code

void fatfs_test_init()
{
    // Initialize data 
    fatfs_data.spi = SPI2;
    fatfs_data.uart = USART2;
    fatfs_data.dma_stream = DMA1_Stream5;
    fatfs_data.tim = TIM9;

    memset((void *)fatfs_data.cb, CLEAR, sizeof(fatfs_data.cb)); 
    fatfs_data.cb_index.cb_size = DATA_BUFF_SIZE; 
    fatfs_data.cb_index.head = CLEAR; 
    fatfs_data.cb_index.tail = CLEAR; 
    fatfs_data.dma_index.data_size = CLEAR; 
    fatfs_data.dma_index.ndt_old = dma_ndt_read(fatfs_data.dma_stream); 
    fatfs_data.dma_index.ndt_new = CLEAR; 
    memset((void *)fatfs_data.data_in_buff, CLEAR, sizeof(fatfs_data.data_in_buff)); 
    memset((void *)fatfs_data.data_out_buff, CLEAR, sizeof(fatfs_data.data_out_buff)); 

    fatfs_data.state_seq = CLEAR;

    //==================================================
    // General setup 

    // Initialize GPIO ports 
    gpio_port_init(); 
    
    // Initialize timers 
    tim_9_to_11_counter_init(
        fatfs_data.tim, 
        TIM_84MHZ_1US_PSC, 
        0xFFFF,  // Max ARR value 
        TIM_UP_INT_DISABLE); 
    tim_enable(fatfs_data.tim);

    //==================================================

    //==================================================
    // UART 
    
