samdonnelly/STM32F4-driver-test/src/tests/device_tests/fatfs_test.c
    // UART2 init - Serial terminal 
    uart_init(
        fatfs_data.uart, 
        GPIOA, 
        PIN_3, 
        PIN_2, 
        UART_PARAM_DISABLE,    // Word length 
        CLEAR_BIT,             // STOP bits 
        UART_FRAC_42_9600, 
        UART_MANT_42_9600, 
        UART_PARAM_DISABLE, 
        UART_PARAM_ENABLE); 
        
    // UART2 interrupt init - Serial terminal - IDLE line (RX) interrupts 
    uart_interrupt_init(
        fatfs_data.uart, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_ENABLE, 
        UART_PARAM_DISABLE, 
        UART_PARAM_DISABLE);
    
    //==================================================

    //==================================================
    // SPI 
    
    // SPI and slave select pin for SD card 
    spi_init(
        fatfs_data.spi, 
        GPIOB,   // SCK pin GPIO port 
        PIN_10,  // SCK pin 
        GPIOB,   // Data (MISO/MOSI) pin GPIO port 
        PIN_14,  // MISO pin 
        PIN_15,  // MOSI pin 
        SPI_BR_FPCLK_8, 
        SPI_CLOCK_MODE_0); 
    spi_ss_init(GPIOB, PIN_12);
    
    //==================================================

    //==================================================
    // DMA 

    // DMA1 stream init - UART2 - Serial terminal 
    dma_stream_init(
        DMA1, 
        fatfs_data.dma_stream, 
        DMA_CHNL_4, 
        DMA_DIR_PM, 
        DMA_CM_ENABLE,
        DMA_PRIOR_HI, 
        DMA_DBM_DISABLE, 
        DMA_ADDR_INCREMENT,   // Increment the buffer pointer to fill the buffer 
        DMA_ADDR_FIXED,       // No peripheral increment - copy from DR only 
        DMA_DATA_SIZE_BYTE, 
        DMA_DATA_SIZE_BYTE);
        
    // DMA1 stream config - UART2 - Serial terminal 
    dma_stream_config(
        fatfs_data.dma_stream, 
        (uint32_t)(&fatfs_data.uart->DR), 
        (uint32_t)fatfs_data.cb, 
        (uint32_t)NULL, 
        (uint16_t)DATA_BUFF_SIZE); 
        
    // Enable DMA streams 
    dma_stream_enable(fatfs_data.dma_stream);    // UART2 - Serial terminal 
    
    //==================================================

    //==================================================
    // Interrupts 

    // Initialize interrupt handler flags 
    int_handler_init(); 

    // Enable the interrupt handlers 
    nvic_config(USART2_IRQn, EXTI_PRIORITY_0);          // UART2 - Serial terminal (user input) 

    //==================================================

    //==================================================
    // SD card init 

    // SD card user initialization 
    fatfs_user_init(fatfs_data.spi, GPIOB, GPIOX_PIN_12); 
    
    //==================================================

    cmd_reset();
} 

//=======================================================================================


//=======================================================================================
// Test code 

void fatfs_test_app()
{
    // New serial terminal (user input) data received 
    if (handler_flags.usart2_flag)
    {
        handler_flags.usart2_flag = CLEAR_BIT;

        // Parse the new user message from the circular buffer into the data buffer 
        dma_cb_index(fatfs_data.dma_stream, &fatfs_data.dma_index, &fatfs_data.cb_index);
        cb_parse(fatfs_data.cb, &fatfs_data.cb_index, fatfs_data.data_in_buff);

        // Dispatch using function pointer 
        fatfs_data.state_func_ptr();
    }

    // // Look for a user command 
    // get_input(
    //     "\r\n>>> ", 
    //     fatfs_data.cmd_buff,  
    //     CMD_SIZE, 
    //     &fatfs_data.read_len, 
    //     FORMAT_FILE_STRING);

    // // Compare the input to the defined user commands 
    // for (uint8_t i = CLEAR; i < NUM_TEST_CMDS; i++)
    // {
    //     if (str_compare(fatfs_data.cmd_buff, cmd_table[i].user_cmds, BYTE_0)) 
    //     {
    //         (cmd_table[i].fatfs_func_ptrs_t)();
    //         break; 
    //     }
    // }
}

//=======================================================================================


//=======================================================================================
// User command functions 

// Format the card 
void file_mkfs(void)
{
    uint8_t timer = 20;

    do
    {
        fatfs_data.fresult = f_mkfs("", FM_EXFAT, 0, fatfs_data.work, sizeof(fatfs_data.work));

        if (fatfs_data.fresult == FR_OK)
        {
            feedback_display("SD Card formatted successfully.\r\n");
        }
        else
        {
            feedback_display("Error mounting card.\r\n");
        }
    }
    while (fatfs_data.fresult != FR_OK && --timer);

    cmd_reset();
}


// Mount card 
void mount_card(void)
{
// #if FORMAT_EXFAT
    
    // Test to see if this will erase existing data 

    // uint8_t timer = 10;
    
    // Format the drive 
    // fatfs_data.fresult = f_mkfs("", FM_EXFAT, 0, fatfs_data.work, sizeof(fatfs_data.work));

    // if (fatfs_data.fresult == FR_OK)
    // // if (timer)
    // {
    //     feedback_display("SD Card formatted successfully.\r\n");
    // }
    // else
    // {
    //     // fault_display();
    //     feedback_display("\r\nError mounting card.\r\n");
    // }

    // do
    // {
    //     fatfs_data.fresult = f_mkfs("", FM_EXFAT, 0, fatfs_data.work, sizeof(fatfs_data.work));

    //     if (fatfs_data.fresult == FR_OK)
    //     {
    //         feedback_display("SD Card formatted successfully.\r\n");
    //     }
    //     else
    //     {
    //         feedback_display("Error mounting card.\r\n");
    //     }
    // }
    // while (fatfs_data.fresult != FR_OK && --timer);

    // tim_delay_ms(fatfs_data.tim, 1000);

// #endif

    fatfs_data.fresult = f_mount(&fatfs_data.file_sys, "", FATFS_MOUNT_NOW); 

    if (fatfs_data.fresult == FR_OK) 
    {
        feedback_display("\nMounted successfully. Volume type: ");

        // Check the volume type 
        switch (fatfs_get_card_type())
        {
            case FATFS_CT_MMC: 
                feedback_display("MMC V3\r\n");
                break;
            case FATFS_CT_SDC1: 
                feedback_display("SDC V1\r\n");
                break;
            case FATFS_CT_SDC2_BLOCK: 
                feedback_display("SDC V2 block\r\n");
                break;
            case FATFS_CT_SDC2_BYTE: 
                feedback_display("SDC V2 byte\r\n");
                break;
            default: 
                feedback_display("Unknown\r\n");
                break;
        }
    }
    else 
    {
        fault_display();
    }

