samdonnelly/STM32F4-driver-test/src/tests/device_tests/fatfs_test.c
    cmd_reset();
}


// Unmount card 
void unmount_card(void) 
{
    // Unmount the volume and clear the initialization status so it can be re-mounted. 
    fatfs_data.fresult = f_unmount("");
    disk.is_initialized[0] = CLEAR;

    (fatfs_data.fresult == FR_OK) ? feedback_display("\nVolume unmounted successfully.\r\n") : 
                                    feedback_display("\nError in unmounting volume.\r\n");

    cmd_reset();
}


// Check card capacity 
void card_capacity(void)
{
    // These calcs assume 512 bytes/sector 

    // Check free space 
    f_getfree("", &fatfs_data.fre_clust, &fatfs_data.pfs);

    // Calculate the total space 
    fatfs_data.total = (uint32_t)((fatfs_data.pfs->n_fatent - 2) * fatfs_data.pfs->csize / 2);
    number_display("\nVolume Total Size (KB): ", fatfs_data.total);
    
    // Calculate the free space 
    fatfs_data.free_space = (uint32_t)(fatfs_data.fre_clust * fatfs_data.pfs->csize / 2);
    number_display("Volume Free Space (KB): ", fatfs_data.free_space);

    cmd_reset();
}


// Check existance of a file or sub-directory 
void file_check(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nFile or directory to check: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Check for the existance of the specified file or directory 
        fatfs_data.fresult = f_stat((TCHAR *)fatfs_data.data_in_buff, &fatfs_data.fno);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nExists: ", (char *)fatfs_data.data_in_buff);
                break;

            case FR_NO_FILE:
                string_display("\r\nDoes not exists: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Remove files on card 
void file_remove(void) 
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nFile to remove: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Attempt to remove the specified file 
        fatfs_data.fresult = f_unlink((TCHAR *)fatfs_data.data_in_buff);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nSuccessfully removed: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Make a new directory 
void file_mkdir(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nDirectory: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Write to the file 
        fatfs_data.fresult = f_mkdir((TCHAR *)fatfs_data.data_in_buff);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nNew directory: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Change the current directory 
void file_chdir(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nDirectory to go to: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Change the directory 
        fatfs_data.fresult = f_chdir((TCHAR *)fatfs_data.data_in_buff);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nNew directory: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Retrieve the current directory and drive 
void file_getcwd(void)
{
    if (fatfs_data.file_sys.fs_type == FS_EXFAT)
    {
        feedback_display("\r\nCan't fetch current directory of exFAT volumes. getcwd return root\r\n");
    }

    char path[DATA_BUFF_SIZE];

    // Get the current directory 
    fatfs_data.fresult = f_getcwd(path, DATA_BUFF_SIZE);

    switch(fatfs_data.fresult)
    {
        case FR_OK:
            string_display("\r\nCurrent directory: ", path);
            break;

        default:
            fault_display();
            break;
    }

    cmd_reset();
}


// Open a directory 
void file_opendir(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nDirectory to open: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Open the specified directory 
        fatfs_data.fresult = f_opendir(&fatfs_data.dj, (TCHAR *)fatfs_data.data_in_buff);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nOpened: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Close an open directory 
void file_closedir(void)
{
    // Close the current directory 
    fatfs_data.fresult = f_closedir(&fatfs_data.dj);

    switch(fatfs_data.fresult)
    {
        case FR_OK:
            feedback_display("\r\nDirectory closed.");
            file_getcwd();
            break;

        default:
            fault_display();
            break;
    }

    cmd_reset();
}


// Check files on the card 
void file_find(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nPath: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);
        feedback_display("\nFiles in path: \r\n");

        // Start to search for files 
        fatfs_data.fresult = f_findfirst(&fatfs_data.dj, &fatfs_data.fno, fatfs_data.data_in_buff, "*");

