samdonnelly/STM32F4-driver-test/src/tests/device_tests/fatfs_test.c
        while ((fatfs_data.fresult == FR_OK) && fatfs_data.fno.fname[0])
        {
            uart_send_str(fatfs_data.uart, "\t- "); 
            uart_send_str(fatfs_data.uart, fatfs_data.fno.fname); 
            uart_send_new_line(fatfs_data.uart); 
            fatfs_data.fresult = f_findnext(&fatfs_data.dj, &fatfs_data.fno); 
        }

        f_closedir(&fatfs_data.dj);
        cmd_reset();
    }
}


// Open a file 
void file_open(void)
{
    static char path[DATA_BUFF_SIZE];

    if (fatfs_data.state_seq == 0)
    {
        feedback_display("\nFile to open: ");
        fatfs_data.state_seq++;
    }
    else if (fatfs_data.state_seq == 1)
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);
        strcpy(path, (char *)fatfs_data.data_in_buff);
        feedback_display("\nAccess mode: ");
        fatfs_data.state_seq++;
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_MODE);

        // Open a file (and create if it doesn't exist) 
        fatfs_data.fresult = f_open(&fatfs_data.file, path, (BYTE)fatfs_data.data_in_num);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nOpened: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Close the open file 
void file_close(void) 
{
    // Close the open file 
    fatfs_data.fresult = f_close(&fatfs_data.file);

    switch(fatfs_data.fresult)
    {
        case FR_OK:
            feedback_display("\r\nFile closed.");
            break;

        default:
            fault_display();
            break;
    }

    cmd_reset();
}


// Read from an open file using using f_read 
void file_read(void) 
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nRead size (bytes): ");
    }
    else
    {
        char file_data[DATA_BUFF_SIZE];
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_NUM);

        // Read from the file 
        fatfs_data.fresult = f_read(&fatfs_data.file, 
                                    (void *)file_data, 
                                    fatfs_data.data_in_num, 
                                    &fatfs_data.br); 

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nFile data: ", file_data);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Write to an open file using f_write 
void file_write(void) 
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nFile data: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Write to the file 
        fatfs_data.fresult = f_write(&fatfs_data.file, 
                                     (void *)fatfs_data.data_in_buff, 
                                     strlen(fatfs_data.data_in_buff), 
                                     &fatfs_data.bw); 

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                string_display("\r\nFile data: ", (char *)fatfs_data.data_in_buff);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Navigate the file 
void file_seek(void) 
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nFile position: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_NUM);

        // Move to the specified position in the file 
        fatfs_data.fresult = f_lseek(&fatfs_data.file, fatfs_data.data_in_num);

        switch(fatfs_data.fresult)
        {
            case FR_OK:
                number_display("\r\nNew file position: ", fatfs_data.data_in_num);
                break;

            default:
                fault_display();
                break;
        }

        cmd_reset();
    }
}


// Navigate to the beginning of the file 
void file_rewind(void) 
{
    fatfs_data.fresult = f_lseek(&fatfs_data.file, RESET_ZERO);

    switch(fatfs_data.fresult)
    {
        case FR_OK:
            feedback_display("\r\nNow at the beginning of the file.");
            break;

        default:
            fault_display();
            break;
    }

    cmd_reset();
}


// Navigate to the end of the file 
void file_fast_fwd(void) 
{
    fatfs_data.fresult = f_lseek(&fatfs_data.file, f_size(&fatfs_data.file));

    switch(fatfs_data.fresult)
    {
        case FR_OK:
            feedback_display("\r\nNow at the end of the file.");
            break;

        default:
            fault_display();
            break;
    }

    cmd_reset();
}


// Read from an open file using f_gets 
void file_gets(void)
{
    char file_data[DATA_BUFF_SIZE];

    // Read from the file 
    TCHAR *data_buff = f_gets(file_data, DATA_BUFF_SIZE, &fatfs_data.file);

    if (data_buff != NULL)
    {
        string_display("\r\nFile data: ", file_data);
    }
    else
    {
        if (f_eof(&fatfs_data.file) != 0)
        {
            feedback_display("\r\nEnd of file reached.");
        }
        else if (f_error(&fatfs_data.file) != 0)
        {
            feedback_display("\r\nHard file error occured.");
        }
        else
        {
            feedback_display("\r\nUnknown error.");
        }
    }

    cmd_reset();
}


// Write to an open file using f_puts 
void file_puts(void)
{
    if (fatfs_data.state_seq++ == 0)
    {
        feedback_display("\nFile data: ");
    }
    else
    {
        format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

        // Write a string to the file 
        int num_characters = f_puts((TCHAR *)fatfs_data.data_in_buff, &fatfs_data.file);
        num_characters += f_puts("\r\n", &fatfs_data.file);

        if (num_characters >= 0)
        {
            number_display("\r\nData written to file. Number of characters written: ", (DWORD)num_characters);
        }
        else
        {
            feedback_display("Write failed.");
        }

