samdonnelly/STM32F4-driver-test/src/tests/device_tests/fatfs_test.c
        cmd_reset();
    }
}


// // Display the contents of 'buffer' 
// void display_buffer(void)
// {
//     uart_send_str(fatfs_data.uart, "\r\nbuffer: \r\n\t"); 
//     uart_send_str(fatfs_data.uart, fatfs_data.buffer); 
//     uart_send_new_line(fatfs_data.uart); 
// }

//=======================================================================================


//=======================================================================================
// Helper functions 

// Select state based on user input 
void cmd_select(void)
{
    uint8_t index = CLEAR;
    format_input((char *)fatfs_data.data_in_buff, &fatfs_data.data_in_num, FORMAT_FILE_STRING);

    // Compare the input to the defined user commands 
    do
    {
        if (str_compare((char *)fatfs_data.data_in_buff, cmd_table[index].user_cmds, BYTE_0)) 
        {
            fatfs_data.state_func_ptr = cmd_table[index].fatfs_func_ptrs_t;
            fatfs_data.state_func_ptr();
            break; 
        }
    }
    while (++index < NUM_TEST_CMDS);

    if (index >= NUM_TEST_CMDS)
    {
        cmd_reset();
    }
}


// Return to default state at the end of the command dispatch 
void cmd_reset(void)
{
    fatfs_data.state_seq = CLEAR;
    fatfs_data.state_func_ptr = &cmd_select;
    feedback_display("\r\n>>> ");
}


// Display a formatting string with a string argument for the user to see 
void string_display(
    const char *string,
    const char *str_arg)
{
    const char str_format[] = "%s\r\n";
    snprintf(fatfs_data.data_out_buff, DATA_BUFF_SIZE, str_format, str_arg);
    feedback_display(string);
    feedback_display(fatfs_data.data_out_buff);
}


// Display a formatting string with a number argument for the user to see 
void number_display(
    const char *string,
    const DWORD num_arg)
{
    const char str_format[] = "%lu\r\n";
    snprintf(fatfs_data.data_out_buff, DATA_BUFF_SIZE, str_format, num_arg);
    feedback_display(string);
    feedback_display(fatfs_data.data_out_buff);
}


// Display the error code related to the FATFS operation 
void fault_display(void)
{
    snprintf(fatfs_data.data_out_buff,
             DATA_BUFF_SIZE,
             "\r\nProblem occurred --> FRESULT == %u\r\n",
             (uint8_t)fatfs_data.fresult);
    feedback_display(fatfs_data.data_out_buff);
}


// Display a string for the user to see 
void feedback_display(const char *string)
{
    uart_send_str(fatfs_data.uart, string);
}


// // Get user inputs 
// void get_input(
//     char *str, 
//     char *buff, 
//     uint8_t buff_len, 
//     QWORD *data, 
//     format_user_input_t op)
// {
//     do 
//     {
//         // Get the info from the user 
//         uart_send_str(fatfs_data.uart, str);
//         while(!uart_data_ready(fatfs_data.uart));
//         uart_get_data(fatfs_data.uart, buff);
//     }
//     while (!format_input(buff, data, op)); 
// }


// Format user input 
uint8_t format_input(
    char *buff, 
    DWORD *data, 
    format_user_input_t op)
{
    uint8_t result = FALSE; 

    if ((buff == NULL) || (data == NULL)) 
    {
        return result; 
    }

    if (op == FORMAT_FILE_STRING)
    {
        // Replace carriage return from input with a null character 
        for (uint8_t i = 0; i < CMD_SIZE; i++)
        {
            if (*buff == CR_CHAR)
            {
                *buff = NULL_CHAR; 
                break; 
            }
            buff++; 
        }

        result = TRUE; 
    }
    else if (op == FORMAT_FILE_MODE)
    {
        if (str_compare("0x", buff, BYTE_0))
        {
            uint8_t nibble; 
            *data = CLEAR; 
            
            // Check the character validity 
            for (uint8_t i = 2; i < 4; i++) 
            {
                nibble = buff[i]; 

                if ((nibble >= ZERO_CHAR) && (nibble <= NINE_CHAR))
                {
                    nibble -= NUM_TO_CHAR_OFFSET; 
                }
                else if ((nibble >= A_UP_CHAR) && (nibble <= F_UP_CHAR)) 
                {
                    nibble -= HEX_TO_LET_CHAR; 
                }
                else
                {
                    break;
                }

                *data |= (nibble << SHIFT_4*(3-i)); 

                if (i == 3)
                {
                    result = TRUE;
                }
            }
        }
    }
    else if (op == FORMAT_FILE_NUM)
    {
        char *buff_copy = buff; 

        while (*buff_copy != CR_CHAR) 
        {
            if (!((*buff_copy >= ZERO_CHAR) && (*buff_copy <= NINE_CHAR)))
            {
                break; 
            }
            buff_copy++; 
        }

        if (*buff_copy == CR_CHAR) 
        {
            *data = (DWORD)atoi(buff); 
            result = TRUE; 
        }
    }

    return result; 
}

//=======================================================================================
